battlerage/app/controllers/game_controller.rb

  def new_game
	 	@new_game = Game.new
	 	@new_game.name = params[:game][:name] #To do...
	 	@new_game.user_id = current_user.id
	  @new_game.save
---
INSERT INTO "games" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-24 15:24:20.840831"], ["name", "Test"], ["updated_at", "2014-09-24 15:24:20.840831"], ["user_id", 2]]

  def game
  	Game.find(params[:id])
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 38]]

  def destroy
  	Game.find(params[:id]).destroy
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 11]]
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 11]]