battlerage/app/views/home/index.html.erb

SELECT "games".* FROM "games"
---
		<div class="col-md-4"> <!-- Game pool -->
			<% games = Game.all %>